cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "thecasualcoder/stable"
tap "fluxcd/tap"
tap "txn2/tap"
tap "datawire/blackbird"
tap "alextodicescu/tgenv"
tap "little-angry-clouds/my-brews"
tap "homebrew/cask-fonts"

# General
brew "ack"
brew "bash"
brew "bash-completion"
brew "openssh"
brew "stow"
brew "coreutils"
brew "direnv"
brew "fzf"
brew "git"
brew "htop"
brew "jq"
brew "pv"
brew "lynx"
brew "mas"
brew "nmap"
brew "rsync"
brew "ssh-copy-id"
brew "telnet"
brew "tree"
brew "watch"
brew "wget"
brew "yq"
brew "shellcheck"
brew "asciinema"
brew "speedtest-cli"
brew "pwgen"
brew "tldr"

# Automation
brew "ansible"

# Cloud
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"

# Programming
brew "git-extras"
brew "git-delta"
cask "diffmerge"
brew "go"
brew "rbenv"
brew "rbenv-bundle-exec"
brew "rbenv-bundler"
brew "pyenv"
brew "shellcheck"
brew "gh"
brew "cookiecutter"

# Collaboration
brew "tmate"

# kubernetes
brew "fluxcd/tap/flux", link: false
brew "istioctl"
brew "kops"
brew "kube-fzf"
brew "kubectx"
brew "kubefwd"
brew "kubernetes-cli", link: false
brew "kbenv"
brew "helm", link: false
brew "helmenv"
brew "helmfile"
brew "kubebuilder"
brew "sops"
brew "stern"
brew "kubeaudit"
# cask "osxfuse"
brew "telepresence"
brew "krew"
brew "kind"
brew "velero"
cask "lens"
brew "kustomize"
brew "argo"
brew "argocd"
brew "FairwindsOps/tap/pluto"
brew "kubeseal"

# Hashicorp
brew "vault"
brew "packer"
brew "tfenv"
brew "tgenv"
brew "tfsec"
brew "terraform-docs"
brew "consul"
brew "terraformer"

# GPG
brew "pinentry-mac"
brew "gnupg", link: false
brew "mkcert"
brew "age"
cask "gpg-suite"
cask "keybase"

# Applications
cask "aerial"
cask "docker"
cask "firefox"
cask "flux", link: false
# cask "google-chrome"
cask "iterm2"
cask "itsycal"
cask "keepassxc"
cask "keepingyouawake"
cask "skype"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "transmission-remote-gui"
# cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "notion"
cask 'clockify'

cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "yubico-yubikey-personalization-gui"

cask "macmediakeyforwarder"
cask "spectacle"

mas "LanScan", id: 472226235
mas "Pocket", id: 568494494
mas "Trello", id: 1278508951
mas "Webcam Settings", id: 533696630
mas "Tailscale", id: 1475387142


cask "font-source-code-pro"
