cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "thecasualcoder/stable"
tap "fluxcd/tap"
tap "txn2/tap"
tap "datawire/blackbird"
tap "alextodicescu/tgenv"
tap "little-angry-clouds/homebrew-my-brews"

# General
brew "ack"
brew "bash-completion"
brew "bash"
brew "coreutils"
brew "direnv"
brew "fzf"
brew "git"
brew "htop"
brew "jq"
brew "lynx"
brew "mas"
brew "nmap"
brew "rsync"
brew "ssh-copy-id"
brew "telnet"
brew "tree"
brew "watch"
brew "wget"
brew "yq"
brew "shellcheck"
brew "asciinema"

# Automation
brew "ansible"

# Cloud
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"

# Programming
brew "git-extras"
cask "diffmerge"
brew "go"
brew "rbenv"
brew "gh"
brew "cookiecutter"

# Collaboration
brew "tmate"

# kubernetes
brew "gotk"
brew "istioctl"
brew "kops"
brew "kube-fzf"
brew "kubectx"
brew "kubefwd"
# brew "kubernetes-cli"
brew "kbenv"
# brew "kubernetes-helm"
brew "helmenv"
brew "sops"
brew "stern"
cask "osxfuse"
brew "telepresence"
brew "krew"
brew "kind"
brew "velero"
cask "lens"
brew "kustomize"
brew "argocd"

# Hashicorp
brew "vault"
brew "packer"
brew "tfenv"
brew "tgenv"
brew "tfsec"
brew "terraform-docs"
brew "consul"

# GPG
brew "pinentry-mac"
brew "gnupg"
brew "mkcert"
cask "gpg-suite"
cask "keybase"

# Applications
cask "aerial"
cask "docker"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "itsycal"
cask "keepassxc"
cask "keepingyouawake"
cask "skype"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "transmission-remote-gui"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"
cask "notion"

mas "Dashlane", id: 552383089
mas "LanScan", id: 472226235
mas "Pocket", id: 568494494
mas "Ring", id: 1142753258
mas "Trello", id: 1278508951
